# Python3 函数：https://www.runoob.com/python3/python3-function.html
# 函数是组织好的，可重复使用的，用来实现单一，或相关联功能的代码段。
#
# 函数能提高应用的模块性，和代码的重复利用率。你已经知道Python提供了许多内建函数，比如print()。但你也可以自己创建函数，这被叫做用户自定义函数。


# 1.0 定义一个函数
# 你可以定义一个由自己想要功能的函数，以下是简单的规则：
#
# 函数代码块以 def 关键词开头，后接函数标识符名称和圆括号 ()。
# 任何传入参数和自变量必须放在圆括号中间，圆括号之间可以用于定义参数。
# 函数的第一行语句可以选择性地使用文档字符串—用于存放函数说明。
# 函数内容以冒号起始，并且缩进。
# return [表达式] 结束函数，选择性地返回一个值给调用方。不带表达式的return相当于返回 None。
# 1.1 实例

# 2.0 函数调用

# 3.0 参数传递
# 3.1 可更改(mutable)与不可更改(immutable)对象
# 3.2 python 传不可变对象实例
# 3.3 传可变对象实例

# 4.0 参数
# 4.1 必需参数
# 4.2 关键字参数
# 4.3 默认参数
# 4.4 不定长参数

# 5.0 匿名函数

# 6.0 return语句

# 7.0 强制位置参数
